Repository: Mohamed-Ahmed-Salah/fushati
Catalog: lib/l10n/app_*.arb
Languages: ar

# fieldOnlyNumbers
source: This field must only contain numbers
ar: يجب أن يحتوي هذا الحقل على أرقام فقط

# onlyNineNumber
source: This field should contain 9 numbers
ar: يجب أن يحتوي هذا الحقل على 9 أرقام

# onlyTwelveNumber
source: This field should contain 12 numbers
ar: يجب أن يحتوي هذا الحقل على 12 أرقام

# fieldDontStartWithZero
source: This field should not start with 0
ar: يجب ألا يبدأ هذا الحقل بصفر

# fieldShouldStartWithKsa
source: This field should start with 9665
ar: يجب ان يبدأ هذا الحقل ب9665

# requiredField
source: This field is required
ar: هذه الخانة مطلوبه

# enterValidEmail
source: Please enter a valid Email
ar: يرجى إدخال البريد الإلكتروني الصحيح

# enterFullName
source: Please enter full name
ar: الرجاء إدخال الاسم الكامل

# enterNameWithNoNumber
source: Please enter valid full name with no numbers
ar: يرجى إدخال اسم كامل بدون أي أرقام

# enterValidFullName
source: Please enter valid full name
ar: الرجاء إدخال الاسم الكامل الصحيح

# selectLanguage
source: Select the app language
ar: حدد لغة التطبيق

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Gender
ar: الجنس

# weAreBetterThanEver
source: We're better than ever
ar: نحن أحسن من أي وقت مضى

source: Update
ar: تحديث

# pleaseUpdateFushati
source: Please update the application
ar: حدِّث التَّطبيق ولا عليك أمر

# termsAndCondition
source: Terms & Conditions
ar: الشروط والأحكام

# payments1
source: Payment Fees and Rates
ar: رسوم ونسب الدفع

# payments2
source: In the context of improving your experience with us, we would like to inform you that when using the payment gateway to top up your wallet, variable fees and rates may apply depending on the type of card used (such as Mada, Visa, or Mastercard). These fees include percentages taken by the payment company and transfer processing fees. You will be notified of the net calculated amount after deductions directly through the app before completing the top-up process.
ar: في سياق تحسين تجربتكم معنا، نود أن نعلمكم بأنه عند استخدام بوابة الدفع لشحن المحفظة، قد تُطبق رسوم ونسب متغيرة بناءً على نوع البطاقة المستخدمة (مثل مدى، فيزا، أو ماستركارد). تتضمن هذه الرسوم نسبًا تأخذها شركة الدفع ورسوم معالجة التحويلات، وسيتم إخطاركم بالقيمة الصافية المحسوبة بعد الخصومات مباشرة عبر التطبيق قبل إتمام عملية الشحن.

# payments3
source: We would like to inform you that when using payment gateways to top up your wallet, variable rates and fees will apply depending on the type of card used (such as Mada, Visa, or Mastercard). These fees include percentages taken by the payment company and transfer processing fees.
ar: نود أن نُعلمكم أنه عند استخدام بوابات الدفع لشحن المحفظة، سيتم تطبيق نسب ورسوم متغيرة تعتمد على نوع البطاقة المستخدمة (مثل مدى، فيزا، أو ماستركارد). هذه الرسوم تشمل نسبًا تأخذها شركة الدفع ورسوم معالجة التحويلات.

# payments4
source: Please make sure to review the net amount before approving the top-up process to ensure transparency and your satisfaction.
ar: يرجى التأكد من مراجعة المبلغ الصافي قبل الموافقة على عملية الشحن لضمان الشفافية ورضاكم

# thanksForUsingFushati
source: Thank you for choosing the Fushati app.
ar: شكرًا لاختياركم تطبيق فسحتي

# usagePolicyDesc1
source: We would like to inform you that your privacy is important to us, and please do not worry when we ask you to provide your personal information when using the app.
ar: نود إعلامك بأن خصوصيتك مهمة لدينا، ونرجو منك أن لا تقلق حين نطلب منك تزويدنا ببياناتك الشخصية عندما تستخدم التطبيق.

# usagePolicyDesc2
source: This privacy policy is an integral part of the terms and conditions of the Fushati app. By using the app, you agree to our use of your information for the purposes stated in the privacy policy. If you do not agree to the terms of this privacy policy, you should stop registering or using the app.
ar: إن سياسة الخصوصية هذه تشكل جزءاً لا يتجزأ من الشروط والأحكام الخاصة بتطبيق فسحتي. فإنك توافق على استخدامنا لها في الأغراض المبينة في سياسة الخصوصية. وفي حال لم توافق على شروط سياسة الخصوصية هذه فيجب عليك التوقف عن التسجيل أو عن استخدام التطبيق.

# p1
source: Fushati offers electronic solutions to keep up with the digital transformation in the Kingdom and align with Vision 2030. The vision of the Fushati app is to organize and streamline the sale operations in school canteens entirely electronically, allowing both students and their parents to transfer money and purchase from the canteen electronically with ease and security.
ar: فسحتي يقدم الحلول الإلكترونية لمواكبة التطور الرقمي في المملكة ومتماشينا مع رؤيه 2030، رؤيه تطبيق فسحتي تنظيم وترتيب عمليات البيع في المقاصف بشكل الإلكتروني كامل، حيث يٌمكن كلاً من الطلاب وأولياء أمورهم من تحويل الأموال والشراء من المقصف الكترونيا بسهولة وأمان

# p2
source: Privacy Policy:
ar: سياسه الخصوصيه:

# p3
source: Personal Information
ar: المعلومات الشخصية

# p4
source: This includes basic information about the student that helps identify the information you provide, as well as details of banking operations and accounts.
ar: هي المعلومات الأساسية عن وعند الطالب التي تسهل تحديد المعلومات التي تقدمها , بالإضافة الى العمليات والتفاصيل الحسابات المصرفيه

# p5
source: Sharing Personal Information with Others
ar: مشاركة المعلومات الشخصية مع الغير

# p6
source: We have the right to share your information with a third party to provide services and assist you in using the app. The third party is also obliged to maintain the confidentiality of your personal information.
ar: يحق لنا مشاركة معلوماتك مع طرف ثالث لتحقيق الخدمات ومساعدتك في تسهيل اجراء استخدام التطبيق, كما ان الطرف الثالث ملزم بالحفاظ على سرية خصوصيه معلوماتك الشخصية

# p7
source: Protecting Your Personal Information
ar: حماية معلوماتك الشخصية

# p8
source: As you know, the internet is not considered a secure means of information. However, our technical team will make every effort to protect your information.
ar: كما تعلم ان الانترت لايتعبر وسيله امانه للمعلومات , في المقابل فرقنا التقني سيبذل جهده لحماية معلوماتك

# p9
source: Dear app user, you agree to be responsible for maintaining the confidentiality of your account information and also agree to notify us if any unauthorized person uses your account password or any other breach of your confidential information in the app.
ar: عزيزي مستخدم التطبيق انت توافق أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وتكون موافقاً أيضا على اخبارنا في حال استخدام شخص غير مفوض به لكلمة مرور حسابك أو أي اختراق آخر لمعلوماتك السرية في التطبيق.

# p10
source: Fushati app will not be responsible for any loss you may incur, directly or indirectly, morally or materially, as a result of disclosing your information to an unauthorized party.
ar: ولن يكون تطبيق فسحتي مسؤول عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنويا أو ماديا نتيجة كشف معلومات الخاصه لطرف غير مفوض له

# p11
source: The Fushati app undertakes to retain your personal and banking information during the period you are using the app. We commit not to handle your personal data for unauthorized or unauthorized purposes, whether for a fee or not, with any other party unless required or authorized by law in Saudi Arabia.
ar: يتعهد تطبيق فسحتي بالاحتفاظ بمعلوماتك الشخصية و المصرفية بالفتره التي تقوم بها اثناء استخدامك للتطبيق . ونتعهد بعدم التعامل مع بياناتك الشخصية لأغراض غير مصرح أو مسموح بها بمقابل أو بدون مقابل مع أي جهة أخرى إلا إذا كان ذلك مطلوباً منا أو مصرحاً به بموجب الأنظمة والتعليمات القانونيه في المملكة

# p12
source: How We Use Your Personal Information
ar: فما نستخدم معلوماتك الشخصية

# p13
source: 1. To create your personal account.
ar: 1.لإنشاء حسابك الشخصي

# p14
source: 2. To improve our services and process technical data such as verifying your phone number or email.
ar: 2.من أجل تحسين خدماتنا ولمعالجه البيانات التقنية مثل التأكد من رقمك أو بريدك

# p15
source: 3. We share your data with electronic payment entities to verify the payment process you perform.
ar: 3.نشارك بياناتك مع جهات الدفع الالكتروني لتوثيق عملية الدفع التي تقوم بها

# p16
source: 4. Other actions to improve the app.
ar: 4.أجراءات أخرى لتطوير من التطبيق

# p17
source: Disclosure of Your Personal Information
ar: الإفصاح عن معلوماتك الشخصية

# p18
source: We have the right to disclose your personal information to others in the following cases:
ar: يحق لنا الإفصاح عن معلوماتك الشخصية للغير في الحالات الآتية:

# p19
source: •To provide services (including electronic account services) available through the app.
ar: •لتقديم الخدمات (بما فيها خدمات الحسابات الالكترونية) المتاحة من خلال التطبيق

# p20
source: •In cases where third parties assist us in providing services to you or performing some functions on our behalf, including IT support services or professional or logistical services.
ar: •في الحالات التي تقدم لنا فيها تلك الأطراف من الغير المساعدة في تقديم خدماتنا لك أو لتنفيذ بعض الوظائف بالنيابة عنا، بما في ذلك خدمات دعم تكنولوجيا المعلومات أو الخدمات المهنية أو اللوجستية

# p21
source: •To comply with the laws or any court order or decision by any competent regulatory authority, or if we believe that disclosing your data is necessary to protect and defend our rights. This includes exchanging data with other companies and organizations for fraud prevention and credit risk reduction purposes.
ar: •امتثالاً للأنظمة أو لأي أمر محكمة أو قرار عن أي هيئة تنظيمية مختصة، أو إذا رأينا أن الإفصاح عن بياناتك ضروري لحماية حقوقنا والدفاع عنها . ويشمل ذلك تبادل البيانات مع الشركات والمؤسسات الأخرى لأغراض مكافحة الغش وتخفيض مخاطر الائتمان

# p22
source: •To comply with any legal requests, we may disclose the user's IP address and all recorded data in the registration page as well as all activities performed by the user through the app, as determined by the request or court order or ruling issued to us.
ar: •من أجل تنفيذ أي طلبات قانونية قد نقوم بالكشف عن عنوان IP الخاص بالمستخدم وكافة البيانات المسجلة في صفحة التسجيل وكذلك كافة الأنشطة التي قام بها المستخدم من خلال التطبيق ، ويتحدد ذلك بناء على الطلب او القرار أو الحكم القضائي الصادر لنا.

# p23
source: Please note that in order for us to respond to requests from government authorities, subpoenas, or court orders, or for the purpose of protecting other users or our systems, we reserve the right to disclose any data if we deem it necessary, including your personal user data (such as name, email address, and other information) and usage history and content provided on the app.
ar: •يرجى العلم بأنه وحتى يتسنى لنا الاستجابة للطلبات الواردة من الجهات الحكومية أو الاستدعاءات أو الأوامر القضائية أو لأغراض حماية المستخدمين الآخرين أو حماية أنظمتنا، فإننا نحتفظ بالحق في الإفصاح عن أي بيانات إذا رأينا ضرورة لذلك، بما فيها بيانات المستخدم الخاصة بك (كالاسم والبريد الإلكتروني والعنوان وغير ذلك) وتاريخ الاستخدام والمحتوى المقدم على التطبيق

# p24
source: Privacy Policy Changes
ar: تغيير سياسة الخصوصية

# p25
source: In the event of changes to this privacy policy, we will notify you immediately via the app. We will also inform you of the changes if necessary. Your continued use of the app will be considered acceptance of the changes made to the privacy policy. If you do not accept the changes, please stop using the app.
ar: في حال تغيير على سياسة الخصوصية هذه فسوف نخبرك فور التطبيق، كما سنبلغكم بالتغييرات إذا دعت الحاجة. ويعتبر استمرارك في استخدام التطبيق قبولاً من جانبك بالتغييرات التي أجريت على سياسة الخصوصية. وفي حال عدم قبولك الرجاء منك التوقف عن استخدام التطبيق

# p26
source: We would also like to inform you that the 'Privacy Policy' is subject to the provisions of the laws in force in Saudi Arabia and its judicial authorities.
ar: كما نود اعلامك بأن "سياسة الخصوصية" تخضع في تفسيرها وتنفيذها وكافة جوانبها لأحكام الأنظمة المطبقة في المملكة العربية السعودية والجهات القضائية بها.

source: Get OTP
ar: ارسال كلمة مرور

# onlyFourNumber
source: This field should contain 4 numbers
ar: يجب أن يحتوي هذا الحقل على 4 أرقام

# newExperience
source: A new experience
ar: تجربه جديده

# forSchool
source: for school cafeterias
ar: لكافيتريات المدارس

source: Log in
ar: تسجيل دخول

# enterPhone
source: Please enter your phone number to complete login or create account.
ar: من فضلك أدخل رقم هاتفك لإتمام عملية تسجيل الدخول أو إنشاء حساب

# ksa
source: Saudi Arabia
ar: المملكة العربية السعودية

# cont
source: Continue
ar: استمرار

source: Enter code
ar: ادخل الرمز

# weSetSMS
source: We’ve sent an SMS with an activation code to your phone
ar: لقد قمنا بإرسال رسالة نصية قصيرة تحتوي على رمز التفعيل إلى هاتفك

# verifyPhone
source: Verify your phone number
ar: تأكيد رقم هاتفك

# weSentOtp
source: We’ve sent an SMS with an activation code to your phone {phone}
ar: لقد أرسلنا رمز التفعيل عبر رسالة نصية إلى هاتفك {phone}

# iDidntGetOtp
source: I didn’t receive a code
ar: لم أستلم الرمز

source: Resend
ar: إعادة الإرسال

# sendCodeIn
source: Send code again {time}
ar: أعد إرسال الرمز في {time}

source: Verify
ar: تأكيد

source: All set!
ar: كل شيء جاهز!

# weRedirectToHome
source: Verification succeeded. We’re redirecting you to the home page
ar: تم التحقق بنجاح. سنقوم بإعادة توجيهك إلى الصفحة الرئيسية

# youDontHaveCards
source: You haven’t added any cards
ar: لم تقم بإضافة أي بطاقات

# addFirstCard
source: Add your first card
ar: أضف بطاقتك الأولى

source: Add new card
ar: إضافة بطاقة جديدة

# pleaseEnterCardNum
source: Please enter card number
ar: يرجى إدخال رقم البطاقة

source: Card number
ar: رقم البطاقة

source: Email
ar: البريد الإلكتروني

source: Student Name
ar: اسم الطالب

source: Student Number
ar: رقم الطالب

source: Card details
ar: تفاصيل البطاقة

source: Name
ar: الاسم

source: Phone number
ar: رقم الهاتف

source: Notes
ar: ملاحظات

# creatingNewCard
source: Creating new student card
ar: إنشاء بطاقة طالب جديدة

source: New Card Added!
ar: تمت إضافة بطاقة جديدة!

# successCardAdded
source: You’ve successfully created new a new card. Click manage to top up your card
ar: لقد نجحت في إنشاء بطاقة جديدة. انقر على إدارة لشحن بطاقتك

source: Done
ar: تأكيد

source: Manage
ar: إدارة

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

source: Next
ar: التالي

source: Top up balance
ar: شحن الرصيد

# enterRechargeAmount
source: Enter the amount you want to charge
ar: أدخل المبلغ الذي تريد شحنه

# enterRechargeAmountWithFees
source: Please note this is a new card which has fees of {fees} only for the first recharge
ar: ملاحظة هذه بطاقة جديدة تحتوي على رسوم قدرها {fees} تدفع عند أول مرة شحن

source: Registration Fees
ar: رسوم التسجيل

source: Manage card
ar: إدارة البطاقة

source: Top up card
ar: شحن البطاقة

source: Delete card
ar: حذف البطاقة

# areYouSureDeleteCard
source: Are you sure you want to delete card?
ar: هل أنت متأكد أنك تريد حذف البطاقة؟

source: Delete
ar: حذف

source: Delete Profile
ar: حذف الحساب

# areYouSureToDelete
source: Are you sure you want to delete your account?
ar: أكيد تبغا تحذف حسابك؟

# deleteAccountMeaning
source: Deleting the account means losing the history associated with this account, and it cannot be recovered permanently.
ar: حذف الحساب يعني أنك راح تفقد السجل المرتبط بهذا الحساب، وما راح تقدر تسترجعهم!

source: Yes
ar: تأكيد

source: No
ar: لا

source: Or
ar: أو

# readingNfc
source: Hold your card near the NFC reader to scan it.
ar: ضع بطاقتك بالقرب من قارئ NFC لمسحها.

# failedReadingNfc
source: Failed to Read Nfc please try again
ar: لم نتمكن من قراءة ال NFC الرجاء المحاوله مره اخرى

source: Transaction history
ar: تاريخ المعاملات

source: Credited
ar: مـُـضــافة

source: Debited
ar: مـخصـُـومة

source: View all
ar: عرض الكل

source: Log out
ar: تسجيل خروج

source: Contact us
ar: اتصل بنا

source: App Language
ar: لغة التطبيق

source: Trans History
ar: تاريخ المعاملات

source: Profile
ar: الحساب الشخصي

# completeProfileButton
source: Complete profile
ar: أكمل الملف الشخصي

# addNewStudentCard
source: Add new student’s card
ar: إضافة بطاقة طالب جديدة

# pleaseEnterStudentCardAndInfo
source: Please enter card number and student info
ar: الرجاء إدخال رقم البطاقة وبيانات الطالب

# tryAgian
source: Try again
ar: اعاده المحاوله

source: Connection lost :(
ar: انقطع الاتصال :(

# connectionLostDesc
source: It seems like you don’t have internet connection. Let’s give it another try
ar: يبدو أنه ليس لديك اتصال بالإنترنت. دعنا نحاول مرة أخرى

source: Card Confirmation Failed
ar: فشل تأكيد البطاقة

# fushatiVerifivation
source: Fushaty card verification
ar: التحقق من بطاقة فسحتي

# verifyCardInfo
source: Please verify your card information
ar: يرجى التحقق من معلومات بطاقتك

source: Phone No.:
ar: رقم الهاتف:

source: Date created:
ar: تاريخ الإنشاء:

source: Card No.:
ar: رقم البطاقة:

source: Card deleted
ar: تم حذف البطاقة

# noWorries
source: No worries! we got everything tide up!
ar: لا تقلق! لقد رتبنا كل شيء!

source: {balance} R.S
ar: ر.س {balance}

# rs
source: {balance} R.s
ar: ر.س {balance}

# transactionId
source: Trx ID
ar: رقم المعاملة

source: School
ar: المدرسة

source: Balance
ar: رصيد

source: Profile details
ar: تفاصيل الملف الشخصي

# completeProfile
source: Please enter your name and email to complete your profile setup
ar: يرجى إدخال اسمك وبريدك الإلكتروني لإكمال إعداد ملفك الشخصي

# nameReq
source: Name (Required)
ar: الاسم (مطلوب)

# emailOption
source: Email (Optional)
ar: البريد الإلكتروني (اختياري)

source: Discard
ar: تجاهل

# transferSuccess
source: Transfer Successful
ar: تم التحويل بنجاح

# amountTransferred
source: You have successfully transferred {amount} R.s. to card number {number}
ar: لقد قمت بتحويل مبلغ {amount} بنجاح إلى رقم البطاقة {number}

# amountTransferredWithFees
source: You have successfully transferred an amount of {amount} R.s to card number {number} with a fee of {fees} R.s
ar: لقد قمت بتحويل مبلغ {amount} بنجاح إلى رقم البطاقة {number}

# nfcIsNotAvailable
source: NFC is not available on this device or is turned off
ar: NFC غير متوفر في هذا الجهاز

# onBoardTitle1
source: Enhanced Parental Control
ar: تعزيز التحكم الأبوي

# onBoardTitle2
source: Comprehensive Service System
ar: نظام خدمة متكامل

# onBoardTitle3
source: Secure and Effortless Payments
ar: دفع آمن وسلس

# onBoardSub1
source: We empower parents with advanced features to monitor their children's daily expenses and set personalized spending limits.
ar: نوفر للآباء ميزات متقدمة لمراقبة نفقات أبنائهم اليومية وتحديد حدود الإنفاق بشكل شخصي.

# onBoardSub2
source: Our system includes an app for parents, a payment tool for students, a point of sale system, a POS and a control panel for canteen owners.
ar: يتضمن نظامنا تطبيقًا للآباء، وأداة دفع للطلاب، ونظام نقاط بيع، ولوحة تحكم لأصحاب المقاصف.

# onBoardSub3
source: Fasahati guarantees secure, hassle-free payments, safeguarding students from theft and ensuring peace of mind for parents.
ar: تضمن فصحتي مدفوعات آمنة وسلسة، مما يحمي الطلاب من السرقة ويوفر راحة البال للآباء.

# validationNameRequired
source: The name field is required.
ar: حقل الاسم مطلوب.

# validationNameString
source: The name must be a string.
ar: يجب أن يكون الاسم نصًا.

# validationNameMax
source: The name may not be greater than 255 characters.
ar: يجب ألا يتجاوز الاسم 255 حرفًا.

# validationEmailInvalid
source: The email must be a valid email address.
ar: يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.

# validationEmailMax
source: The email may not be greater than 255 characters.
ar: يجب ألا يتجاوز البريد الإلكتروني 255 حرفًا.

# validationEmailUnique
source: The email has already been taken.
ar: تم استخدام هذا البريد الإلكتروني من قبل.

# validationPasswordString
source: The password must be a string.
ar: يجب أن تكون كلمة المرور نصًا.

# validationPasswordMin
source: The password must be at least 6 characters.
ar: يجب ألا تقل كلمة المرور عن 6 أحرف.

# validationUserPhoneRequired
source: The phone number is required.
ar: رقم الهاتف مطلوب.

# validationUserPhoneString
source: The phone number must be a string.
ar: يجب أن يكون رقم الهاتف نصًا.

# validationUserPhoneMax
source: The phone number may not be greater than 255 characters.
ar: يجب ألا يتجاوز رقم الهاتف 255 حرفًا.

# validationUserPhoneUnique
source: The phone number has already been taken.
ar: تم استخدام رقم الهاتف من قبل.

# validationUserPhoneInvalid
source: The phone number format is invalid.
ar: تنسيق رقم الهاتف غير صالح.

# validationDepartmentString
source: The department must be a string.
ar: يجب أن يكون القسم نصًا.

# validationDepartmentMax
source: The department may not be greater than 255 characters.
ar: يجب ألا يتجاوز القسم 255 حرفًا.

# validationPositionString
source: The position must be a string.
ar: يجب أن تكون الوظيفة نصًا.

# validationPositionMax
source: The position may not be greater than 255 characters.
ar: يجب ألا تتجاوز الوظيفة 255 حرفًا.

# validationUserNumberMax
source: The user number may not be greater than 255 characters.
ar: يجب ألا يتجاوز الرقم المستخدم 255 حرفًا.

# validationUserNumberUnique
source: The user number has already been taken.
ar: تم استخدام الرقم المستخدم من قبل.

# validationUserCardRequired
source: The user card is required.
ar: بطاقة المستخدم مطلوبة.

# validationUserCardMax
source: The user card may not be greater than 255 characters.
ar: يجب ألا تتجاوز بطاقة المستخدم 255 حرفًا.

# validationUserCardUnique
source: The user card has already been taken.
ar: تم استخدام بطاقة المستخدم من قبل.

# validationEquipmentString
source: The equipment must be a string.
ar: يجب أن تكون المعدات نصًا.

# validationEquipmentMax
source: The equipment may not be greater than 255 characters.
ar: يجب ألا تتجاوز المعدات 255 حرفًا.

# validationIdentityIdString
source: The identity ID must be a string.
ar: يجب أن يكون رقم الهوية نصًا.

# validationIdentityIdMax
source: The identity ID may not be greater than 255 characters.
ar: يجب ألا يتجاوز رقم الهوية 255 حرفًا.

# validationIdentityIdUnique
source: The identity ID has already been taken.
ar: تم استخدام رقم الهوية من قبل.

# validationRoleString
source: The role must be a string.
ar: يجب أن تكون الوظيفة نصًا.

# validationTypeRequired
source: The type field is required.
ar: حقل النوع مطلوب.

# validationTypeString
source: The type must be a string.
ar: يجب أن يكون النوع نصًا.

# validationTypeInvalid
source: The selected type is invalid.
ar: النوع المحدد غير صالح.

# validationFaceImagesImage
source: Each face image must be an image file.
ar: يجب أن تكون كل صورة وجه ملف صورة.

# validationFaceImagesMimes
source: Each face image must be a file of type: jpeg, png, jpg, gif.
ar: يجب أن تكون كل صورة وجه من النوع: jpeg, png, jpg, gif.

# validationFaceImagesMax
source: Each face image may not be greater than 2 MB.
ar: يجب ألا تتجاوز كل صورة وجه 2 ميغابايت.
